--
-- PostgreSQL database dump
--

-- Dumped from database version 16.9 (84ade85)
-- Dumped by pg_dump version 16.9

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: catalog_products; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public.catalog_products (
    id character varying DEFAULT gen_random_uuid() NOT NULL,
    product_code text NOT NULL,
    name text NOT NULL,
    unit text DEFAULT 'упак'::text NOT NULL,
    quantity integer DEFAULT 0,
    barcode text,
    price text,
    category text NOT NULL,
    collection text,
    color text,
    format text,
    surface text,
    image_url text,
    images json DEFAULT '[]'::json NOT NULL,
    description text,
    specifications json DEFAULT '{}'::json,
    profile text,
    availability text DEFAULT 'В наличии'::text,
    is_active integer DEFAULT 1,
    sort_order integer DEFAULT 0,
    created_at timestamp without time zone DEFAULT now(),
    updated_at timestamp without time zone DEFAULT now(),
    area_per_package numeric,
    pcs_per_package numeric
);


ALTER TABLE public.catalog_products OWNER TO neondb_owner;

--
-- Name: certificates; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public.certificates (
    id character varying DEFAULT gen_random_uuid() NOT NULL,
    title text NOT NULL,
    description text NOT NULL,
    issue_date text NOT NULL,
    valid_until text NOT NULL,
    issuer text NOT NULL,
    size text NOT NULL,
    number text NOT NULL,
    image_url text,
    file_url text,
    sort_order integer DEFAULT 0,
    created_at timestamp without time zone DEFAULT now(),
    updated_at timestamp without time zone DEFAULT now()
);


ALTER TABLE public.certificates OWNER TO neondb_owner;

--
-- Name: dealer_locations; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public.dealer_locations (
    id character varying DEFAULT gen_random_uuid() NOT NULL,
    name text NOT NULL,
    address text NOT NULL,
    city text NOT NULL,
    region text NOT NULL,
    phone text,
    email text,
    website text,
    latitude text NOT NULL,
    longitude text NOT NULL,
    dealer_type text NOT NULL,
    services json DEFAULT '[]'::json NOT NULL,
    working_hours text,
    is_active integer DEFAULT 1,
    sort_order integer DEFAULT 0,
    created_at timestamp without time zone DEFAULT now(),
    updated_at timestamp without time zone DEFAULT now()
);


ALTER TABLE public.dealer_locations OWNER TO neondb_owner;

--
-- Name: gallery_projects; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public.gallery_projects (
    id character varying DEFAULT gen_random_uuid() NOT NULL,
    title text NOT NULL,
    description text NOT NULL,
    application text NOT NULL,
    images json DEFAULT '[]'::json NOT NULL,
    materials_used json DEFAULT '[]'::json NOT NULL,
    location text,
    area text,
    year text,
    is_active integer DEFAULT 1,
    sort_order integer DEFAULT 0,
    created_at timestamp without time zone DEFAULT now(),
    updated_at timestamp without time zone DEFAULT now()
);


ALTER TABLE public.gallery_projects OWNER TO neondb_owner;

--
-- Name: hero_images; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public.hero_images (
    id character varying DEFAULT gen_random_uuid() NOT NULL,
    title text NOT NULL,
    image_url text NOT NULL,
    is_active integer DEFAULT 1,
    sort_order integer DEFAULT 0,
    created_at timestamp without time zone DEFAULT now(),
    updated_at timestamp without time zone DEFAULT now()
);


ALTER TABLE public.hero_images OWNER TO neondb_owner;

--
-- Name: installation_instructions; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public.installation_instructions (
    id character varying DEFAULT gen_random_uuid() NOT NULL,
    title text NOT NULL,
    description text,
    category text NOT NULL,
    size text NOT NULL,
    file_url text,
    sort_order integer DEFAULT 0,
    created_at timestamp without time zone DEFAULT now(),
    updated_at timestamp without time zone DEFAULT now()
);


ALTER TABLE public.installation_instructions OWNER TO neondb_owner;

--
-- Name: users; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public.users (
    id character varying DEFAULT gen_random_uuid() NOT NULL,
    username text NOT NULL,
    password text NOT NULL
);


ALTER TABLE public.users OWNER TO neondb_owner;

--
-- Name: video_instructions; Type: TABLE; Schema: public; Owner: neondb_owner
--

CREATE TABLE public.video_instructions (
    id character varying DEFAULT gen_random_uuid() NOT NULL,
    title text NOT NULL,
    description text NOT NULL,
    duration text NOT NULL,
    category text NOT NULL,
    video_url text,
    thumbnail_url text,
    sort_order integer DEFAULT 0,
    created_at timestamp without time zone DEFAULT now(),
    updated_at timestamp without time zone DEFAULT now()
);


ALTER TABLE public.video_instructions OWNER TO neondb_owner;

--
-- Data for Name: catalog_products; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public.catalog_products (id, product_code, name, unit, quantity, barcode, price, category, collection, color, format, surface, image_url, images, description, specifications, profile, availability, is_active, sort_order, created_at, updated_at, area_per_package, pcs_per_package) FROM stdin;
2d1d7f28-dc6f-4022-a984-05a7753f850f	AUTO_0	Магия Бетона	nan	0	\N		SPC панели	nan	Стандарт		упак		[]	Панель Магия Бетона	{}	\N	nan	1	0	2025-08-28 08:50:43.660909	2025-08-28 08:50:43.660914	\N	\N
39995108-7235-4875-822d-ca72f31af81f	SPC8934	Панель SPC стеновая Альта Слэб Магия Бетона 300х600х2,4мм 4,32м2/уп (24шт/уп) Закат	упак	0	4650218304122.0	4739.04	SPC панели	Магия бетона	Закат	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Магия Бетона 300х600х2,4мм 4,32м2/уп (24шт/уп) Закат	{}	\N	Склад	1	1	2025-08-28 08:50:43.691314	2025-08-28 08:50:43.691319	4.32	24.0
bb0b5e64-3bc9-407b-9432-44865392a84b	SPC8938	Панель SPC стеновая Альта Слэб Магия Бетона 600х1200х2,4мм 5,04м2/уп (7шт/уп) Закат	упак	0	4650218304108.0	5528.88	SPC панели	Магия бетона	Закат	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Магия Бетона 600х1200х2,4мм 5,04м2/уп (7шт/уп) Закат	{}	\N	Склад	1	2	2025-08-28 08:50:43.712923	2025-08-28 08:50:43.712927	5.04	7.0
6cdbec9c-6ba7-40a9-961f-3c16ec3b23ff	SPC8930	Панель SPC стеновая Альта Слэб Магия Бетона 300х600х2,4мм 4,32м2/уп (24шт/уп) Метеорит	упак	0	4650218304184.0	4739.04	SPC панели	Магия бетона	Метеорит	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Магия Бетона 300х600х2,4мм 4,32м2/уп (24шт/уп) Метеорит	{}	\N	Склад	1	3	2025-08-28 08:50:43.736273	2025-08-28 08:50:43.736277	4.32	24.0
6c631f20-3a11-46a6-9a13-3448de6ef15b	SPC8931	Панель SPC стеновая Альта Слэб Магия Бетона 600х1200х2,4мм 5,04м2/уп (7шт/уп) Метеорит	упак	0	4650218304245.0	5528.88	SPC панели	Магия бетона	Метеорит	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Магия Бетона 600х1200х2,4мм 5,04м2/уп (7шт/уп) Метеорит	{}	\N	Склад	1	4	2025-08-28 08:50:43.758008	2025-08-28 08:50:43.758012	5.04	7.0
53ace7db-2409-4b03-80aa-4746300a517a	SPC8936	Панель SPC стеновая Альта Слэб Магия Бетона 300х600х2,4мм 4,32м2/уп (24шт/уп) Комета	упак	0	4650218304146.0	4739.04	SPC панели	Магия бетона	Комета	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Магия Бетона 300х600х2,4мм 4,32м2/уп (24шт/уп) Комета	{}	\N	Склад	1	5	2025-08-28 08:50:43.779789	2025-08-28 08:50:43.779793	4.32	24.0
f39878d1-3e68-4fba-9b44-788591cf6db6	SPC8940	Панель SPC стеновая Альта Слэб Магия Бетона 600х1200х2,4мм 5,04м2/уп (7шт/уп) Комета	упак	0	4650218304207.0	5528.88	SPC панели	Магия бетона	Комета	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Магия Бетона 600х1200х2,4мм 5,04м2/уп (7шт/уп) Комета	{}	\N	Склад	1	6	2025-08-28 08:50:43.801515	2025-08-28 08:50:43.80152	5.04	7.0
71642845-d73a-4c9b-90a6-88697bffb11c	SPC8932	Панель SPC стеновая Альта Слэб Магия Бетона 300х600х2,4мм 4,32м2/уп (24шт/уп) Полнолуние	упак	0	4650218304160.0	4739.04	SPC панели	Магия бетона	Полнолуние	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Магия Бетона 300х600х2,4мм 4,32м2/уп (24шт/уп) Полнолуние	{}	\N	Склад	1	7	2025-08-28 08:50:43.824458	2025-08-28 08:50:43.824462	4.32	24.0
22ddd059-c214-42eb-ac2d-3a55da007cc8	SPC8939	Панель SPC стеновая Альта Слэб Магия Бетона 600х1200х2,4мм 5,04м2/уп (7шт/уп) Полнолуние	упак	0	4650218304221.0	5528.88	SPC панели	Магия бетона	Полнолуние	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Магия Бетона 600х1200х2,4мм 5,04м2/уп (7шт/уп) Полнолуние	{}	\N	Склад	1	8	2025-08-28 08:50:43.846947	2025-08-28 08:50:43.846951	5.04	7.0
45b4546c-a89e-483a-bb15-b36af8ae59a8	SPC8935	Панель SPC стеновая Альта Слэб Магия Бетона 300х600х2,4мм 4,32м2/уп (24шт/уп) Рассвет	упак	0	4650218304269.0	4739.04	SPC панели	Магия бетона	Рассвет	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Магия Бетона 300х600х2,4мм 4,32м2/уп (24шт/уп) Рассвет	{}	\N	Склад	1	9	2025-08-28 08:50:43.868556	2025-08-28 08:50:43.868559	4.32	24.0
e34bd522-57b8-4bda-85f4-0040368c77ac	SPC8937	Панель SPC стеновая Альта Слэб Магия Бетона 600х1200х2,4мм 5,04м2/уп (7шт/уп) Рассвет	упак	0	4650218304283.0	5528.88	SPC панели	Магия бетона	Рассвет	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Магия Бетона 600х1200х2,4мм 5,04м2/уп (7шт/уп) Рассвет	{}	\N	Склад	1	10	2025-08-28 08:50:43.890146	2025-08-28 08:50:43.890148	5.04	7.0
1d7dce68-0128-4a96-8504-bc3ec7c4dc6c	SPC8933	Панель SPC стеновая Альта Слэб Магия Бетона 300х600х2,4мм 4,32м2/уп (24шт/уп) Азимут	упак	0	4650218304085.0	4739.04	SPC панели	Магия бетона	Азимут	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Магия Бетона 300х600х2,4мм 4,32м2/уп (24шт/уп) Азимут	{}	\N	Склад	1	11	2025-08-28 08:50:43.911657	2025-08-28 08:50:43.911659	4.32	24.0
03e56280-0450-44c6-806d-3a8ead18d5e5	SPC8941	Панель SPC стеновая Альта Слэб Магия Бетона 600х1200х2,4мм 5,04м2/уп (7шт/уп) Азимут	упак	0	4650218304061.0	5528.88	SPC панели	Магия бетона	Азимут	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Магия Бетона 600х1200х2,4мм 5,04м2/уп (7шт/уп) Азимут	{}	\N	Склад	1	12	2025-08-28 08:50:43.93329	2025-08-28 08:50:43.933294	5.04	7.0
368654af-08e8-4d41-bf72-c806b3e66bcc	AUTO_13	Матовая Эстетика	nan	0	\N	nan	SPC панели	nan	Стандарт		упак		[]	Панель Матовая Эстетика	{}	\N	nan	1	13	2025-08-28 08:50:43.954917	2025-08-28 08:50:43.95492	\N	\N
7ed3e97a-2c36-4fa7-a471-577f57f3a547	SPC8883	Панель SPC стеновая Альта Слэб Матовая Эстетика 300х600х2,4мм 4,32м2/уп (24шт/уп) Грейдж	упак	0	4650218304306.0	4739.04	SPC панели	Матовая эстетика	Грейдж	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Матовая Эстетика 300х600х2,4мм 4,32м2/уп (24шт/уп) Грейдж	{}	\N	Склад	1	14	2025-08-28 08:50:43.976552	2025-08-28 08:50:43.976555	4.32	24.0
641073f5-d7af-4f3d-b7e3-afe48527523c	SPC8888	Панель SPC стеновая Альта Слэб Матовая Эстетика 600х1200х2,4мм 5,04м2/уп (7шт/уп) Грейдж	упак	0	4650218304320.0	5528.88	SPC панели	Матовая эстетика	Грейдж	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Матовая Эстетика 600х1200х2,4мм 5,04м2/уп (7шт/уп) Грейдж	{}	\N	Склад	1	15	2025-08-28 08:50:43.998466	2025-08-28 08:50:43.998471	5.04	7.0
58a8cf20-ff44-4c12-9d01-152d0689ce30	SPC8885	Панель SPC стеновая Альта Слэб Матовая Эстетика 300х600х2,4мм 4,32м2/уп (24шт/уп) Крот	упак	0	4650218304443.0	4739.04	SPC панели	Матовая эстетика	Крот	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Матовая Эстетика 300х600х2,4мм 4,32м2/уп (24шт/уп) Крот	{}	\N	Склад	1	16	2025-08-28 08:50:44.020289	2025-08-28 08:50:44.020293	4.32	24.0
e1fff51b-853a-487a-b380-c7ca0d6108bb	SPC8906	Панель SPC стеновая Альта Слэб Матовая Эстетика 600х1200х2,4мм 5,04м2/уп (7шт/уп) Крот	упак	0	4650218304382.0	5528.88	SPC панели	Матовая эстетика	Крот	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Матовая Эстетика 600х1200х2,4мм 5,04м2/уп (7шт/уп) Крот	{}	\N	Склад	1	17	2025-08-28 08:50:44.041928	2025-08-28 08:50:44.041932	5.04	7.0
4073a6a6-eef7-4624-8de9-bfa7763f893c	SPC8887	Панель SPC стеновая Альта Слэб Матовая Эстетика 300х600х2,4мм 4,32м2/уп (24шт/уп) Тауп	упак	0	4650218304429.0	4739.04	SPC панели	Матовая эстетика	Тауп	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Матовая Эстетика 300х600х2,4мм 4,32м2/уп (24шт/уп) Тауп	{}	\N	Склад	1	18	2025-08-28 08:50:44.06393	2025-08-28 08:50:44.063935	4.32	24.0
c099784c-fcff-409c-ab4a-31bc56075f31	SPC8890	Панель SPC стеновая Альта Слэб Матовая Эстетика 600х1200х2,4мм 5,04м2/уп (7шт/уп) Тауп	упак	0	4650218304368.0	5528.88	SPC панели	Матовая эстетика	Тауп	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Матовая Эстетика 600х1200х2,4мм 5,04м2/уп (7шт/уп) Тауп	{}	\N	Склад	1	19	2025-08-28 08:50:44.085647	2025-08-28 08:50:44.085651	5.04	7.0
524bd2f4-0b94-4277-85a9-37d36f0f620b	SPC8886	Панель SPC стеновая Альта Слэб Матовая Эстетика 300х600х2,4мм 4,32м2/уп (24шт/уп) Экрю	упак	0	4650218304405.0	4739.04	SPC панели	Матовая эстетика	Экрю	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Матовая Эстетика 300х600х2,4мм 4,32м2/уп (24шт/уп) Экрю	{}	\N	Склад	1	20	2025-08-28 08:50:44.107527	2025-08-28 08:50:44.10753	4.32	24.0
17b39ab7-a3ad-41b0-b9b8-710cc72b22b3	SPC8889	Панель SPC стеновая Альта Слэб Матовая Эстетика 600х1200х2,4мм 5,04м2/уп (7шт/уп) Экрю	упак	0	4650218304344.0	5528.88	SPC панели	Матовая эстетика	Экрю	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Матовая Эстетика 600х1200х2,4мм 5,04м2/уп (7шт/уп) Экрю	{}	\N	Склад	1	21	2025-08-28 08:50:44.129053	2025-08-28 08:50:44.129056	5.04	7.0
63cf56a7-b7e6-4e2d-9b4a-42d5a44b20fd	AUTO_22	Мраморная Феерия	nan	0	\N	nan	SPC панели	nan	Стандарт		упак		[]	Панель Мраморная Феерия	{}	\N	nan	1	22	2025-08-28 08:50:44.150739	2025-08-28 08:50:44.150744	\N	\N
1dcac730-1586-4465-8c79-7b3ae73762a1	SPC8919	Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Везувий	упак	0	4650218304641.0	4739.04	SPC панели	Мраморная феерия	Везувий	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Везувий	{}	\N	Склад	1	23	2025-08-28 08:50:44.172547	2025-08-28 08:50:44.17255	4.32	24.0
85a912e3-2ac7-474d-a118-3b2459ffe3ea	SPC8927	Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Везувий	упак	0	4650218304849.0	5528.88	SPC панели	Мраморная феерия	Везувий	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Везувий	{}	\N	Склад	1	24	2025-08-28 08:50:44.194337	2025-08-28 08:50:44.19434	5.04	7.0
0c58a952-120a-493f-80ee-dffd2431a78e	SPC8917	Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Гекла	упак	0	4650218304627.0	4739.04	SPC панели	Мраморная феерия	Гекла	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Гекла	{}	\N	Склад	1	25	2025-08-28 08:50:44.215911	2025-08-28 08:50:44.215916	4.32	24.0
40ec5cf5-c3e2-453a-95c1-506d30a1a04d	SPC8925	Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Гекла	упак	0	4650218304825.0	5528.88	SPC панели	Мраморная феерия	Гекла	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Гекла	{}	\N	Склад	1	26	2025-08-28 08:50:44.237821	2025-08-28 08:50:44.237826	5.04	7.0
40126caa-c1dd-46da-8e94-26010e10d9e8	SPC8913	Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Кракатау	упак	0	4650218304603.0	4739.04	SPC панели	Мраморная феерия	Кракатау	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Кракатау	{}	\N	Склад	1	27	2025-08-28 08:50:44.259879	2025-08-28 08:50:44.259883	4.32	24.0
84bcfeb1-2863-4870-a5b5-2247b1602cc2	SPC8912	Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Кракатау	упак	0	4650218304801.0	5528.88	SPC панели	Мраморная феерия	Кракатау	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Кракатау	{}	\N	Склад	1	28	2025-08-28 08:50:44.282204	2025-08-28 08:50:44.282209	5.04	7.0
d9b2ade0-5c50-466a-a102-1f8b6f6d8273	SPC8910	Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Мисти	упак	0	4650218304580.0	4739.04	SPC панели	Мраморная феерия	Мисти	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Мисти	{}	\N	Склад	1	29	2025-08-28 08:50:44.305545	2025-08-28 08:50:44.30555	4.32	24.0
09703450-e3b6-44fc-81be-00d51d75f730	SPC8909	Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Мисти	упак	0	4650218304788.0	5528.88	SPC панели	Мраморная феерия	Мисти	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Мисти	{}	\N	Склад	1	30	2025-08-28 08:50:44.3274	2025-08-28 08:50:44.327405	5.04	7.0
584e9d69-aff4-40e1-8d78-e5e27cb52695	SPC8911	Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Орисаба	упак	0	4650218304566.0	4739.04	SPC панели	Мраморная феерия	Орисаба	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Орисаба	{}	\N	Склад	1	31	2025-08-28 08:50:44.349736	2025-08-28 08:50:44.349742	4.32	24.0
26556114-1f51-41c1-bcc9-2cb0c74076da	SPC8920	Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Орисаба	упак	0	4650218304764.0	5528.88	SPC панели	Мраморная феерия	Орисаба	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Орисаба	{}	\N	Склад	1	32	2025-08-28 08:50:44.37275	2025-08-28 08:50:44.372755	5.04	7.0
472a4833-e757-4a52-8e90-442a85a87594	SPC8916	Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Рейнир	упак	0	4650218304542.0	4739.04	SPC панели	Мраморная феерия	Рейнир	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Рейнир	{}	\N	Склад	1	33	2025-08-28 08:50:44.394765	2025-08-28 08:50:44.39477	4.32	24.0
e4fcd6df-d574-416e-854b-769687e90334	SPC8924	Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Рейнир	упак	0	4650218304740.0	5528.88	SPC панели	Мраморная феерия	Рейнир	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Рейнир	{}	\N	Склад	1	34	2025-08-28 08:50:44.417319	2025-08-28 08:50:44.417323	5.04	7.0
5dbfa8e3-9199-4962-8dc0-edce7e23defb	SPC8914	Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Сангай	упак	0	4650218304528.0	4739.04	SPC панели	Мраморная феерия	Сангай	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Сангай	{}	\N	Склад	1	35	2025-08-28 08:50:44.438993	2025-08-28 08:50:44.438997	4.32	24.0
91a3ad15-0e8d-4ed9-8746-c5e5f965ab3f	SPC8922	Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Сангай	упак	0	4650218304726.0	5528.88	SPC панели	Мраморная феерия	Сангай	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Сангай	{}	\N	Склад	1	36	2025-08-28 08:50:44.46033	2025-08-28 08:50:44.460332	5.04	7.0
43f1f1e8-acce-4f56-8184-c84f754db6be	SPC8915	Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Фудзияма	упак	0	4650218304504.0	4739.04	SPC панели	Мраморная феерия	Фудзияма	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Фудзияма	{}	\N	Склад	1	37	2025-08-28 08:50:44.481732	2025-08-28 08:50:44.481735	4.32	24.0
0a43c494-5725-4565-af37-6a11b2924899	SPC8923	Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Фудзияма	упак	0	4650218304702.0	5528.88	SPC панели	Мраморная феерия	Фудзияма	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Фудзияма	{}	\N	Склад	1	38	2025-08-28 08:50:44.503236	2025-08-28 08:50:44.503238	5.04	7.0
b75785b2-17c6-4e11-b322-3be1d0102a2f	SPC8908	Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Эльбрус	упак	0	4650218304481.0	4739.04	SPC панели	Мраморная феерия	Эльбрус	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Эльбрус	{}	\N	Склад	1	39	2025-08-28 08:50:44.524949	2025-08-28 08:50:44.524952	4.32	24.0
f0de0dab-e8bf-4924-9e68-a055c215f47a	SPC8921	Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Эльбрус	упак	0	4650218304689.0	5528.88	SPC панели	Мраморная феерия	Эльбрус	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Эльбрус	{}	\N	Склад	1	40	2025-08-28 08:50:44.546585	2025-08-28 08:50:44.546587	5.04	7.0
d7839760-3346-40ed-8800-b1492c1313e8	SPC8918	Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Этна	упак	0	4650218304467.0	4739.04	SPC панели	Мраморная феерия	Этна	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 300х600х2,4мм 4,32м2/уп (24шт/уп) Этна	{}	\N	Склад	1	41	2025-08-28 08:50:44.567987	2025-08-28 08:50:44.56799	4.32	24.0
5500aa32-5f59-449d-958c-0aaef9e73c90	SPC8926	Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Этна	упак	0	4650218304665.0	5528.88	SPC панели	Мраморная феерия	Этна	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Мраморная Феерия 600х1200х2,4мм 5,04м2/уп (7шт/уп) Этна	{}	\N	Склад	1	42	2025-08-28 08:50:44.590085	2025-08-28 08:50:44.590089	5.04	7.0
218b4d22-8ff2-49ed-9975-2c1b078055d4	AUTO_43	Тканевая Роскошь	nan	0	\N	nan	SPC панели	nan	Стандарт		упак		[]	Панель Тканевая Роскошь	{}	\N	nan	1	43	2025-08-28 08:50:44.611746	2025-08-28 08:50:44.611748	\N	\N
90b81efd-b989-4cdb-b266-fd3d5acac121	SPC8898	Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Атлас	упак	0	4650218304986.0	4739.04	SPC панели	Тканевая Роскошь	Атлас	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Атлас	{}	\N	Склад	1	44	2025-08-28 08:50:44.633185	2025-08-28 08:50:44.633187	4.32	24.0
eb23fb85-f9c5-458a-94f9-f4785d118307	SPC8905	Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Атлас	упак	0	4650218305167.0	5528.88	SPC панели	Тканевая Роскошь	Атлас	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Атлас	{}	\N	Склад	1	45	2025-08-28 08:50:44.654631	2025-08-28 08:50:44.654634	5.04	7.0
eb796a52-ccff-4976-b623-8a501635a13e	SPC8894	Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Батист	упак	0	4650218304962.0	4739.04	SPC панели	Тканевая Роскошь	Батист	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Батист	{}	\N	Склад	1	46	2025-08-28 08:50:44.676242	2025-08-28 08:50:44.676245	4.32	24.0
ced3d579-5e2e-4cac-a727-df1121da3bad	SPC8900	Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Батист	упак	0	4650218305143.0	5528.88	SPC панели	Тканевая Роскошь	Батист	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Батист	{}	\N	Склад	1	47	2025-08-28 08:50:44.697596	2025-08-28 08:50:44.697598	5.04	7.0
b9f4df97-c9e0-4f57-bc76-78b5f3c15270	SPC8891	Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Вуаль	упак	0	4650218304948.0	4739.04	SPC панели	Тканевая Роскошь	Вуаль	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Вуаль	{}	\N	Склад	1	48	2025-08-28 08:50:44.719187	2025-08-28 08:50:44.71919	4.32	24.0
32354775-c8aa-459a-ac81-09f291d374a4	SPC8884	Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Вуаль	упак	0	4650218305129.0	5528.88	SPC панели	Тканевая Роскошь	Вуаль	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Вуаль	{}	\N	Склад	1	49	2025-08-28 08:50:44.740825	2025-08-28 08:50:44.740829	5.04	7.0
acc21de5-69c5-45f7-93f0-819cd5eee32f	SPC8897	Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Деним	упак	0	4650218304924.0	4739.04	SPC панели	Тканевая Роскошь	Деним	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Деним	{}	\N	Склад	1	50	2025-08-28 08:50:44.762776	2025-08-28 08:50:44.76278	4.32	24.0
06622448-42dd-4315-b81c-2a561fc54ae2	SPC8904	Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Деним	упак	0	4650218305105.0	5528.88	SPC панели	Тканевая Роскошь	Деним	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Деним	{}	\N	Склад	1	51	2025-08-28 08:50:44.784363	2025-08-28 08:50:44.784367	5.04	7.0
e352762a-4ca6-402b-82d2-d6016644f34b	SPC8893	Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Жоржет	упак	0	4650218304900.0	4739.04	SPC панели	Тканевая Роскошь	Жоржет	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Жоржет	{}	\N	Склад	1	52	2025-08-28 08:50:44.806624	2025-08-28 08:50:44.806629	4.32	24.0
a0387392-f172-464c-ba1e-f5772f216f88	SPC8901	Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Жоржет	упак	0	4650218305082.0	5528.88	SPC панели	Тканевая Роскошь	Жоржет	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Жоржет	{}	\N	Склад	1	53	2025-08-28 08:50:44.828351	2025-08-28 08:50:44.828355	5.04	7.0
584ee0c6-fc09-4cab-a7db-bcd42fe974b6	SPC8892	Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Лён	упак	0	4650218304887.0	4739.04	SPC панели	Тканевая Роскошь	Лён	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Лён	{}	\N	Склад	1	54	2025-08-28 08:50:44.84997	2025-08-28 08:50:44.849974	4.32	24.0
e0664722-6003-408f-b6cf-737a52efd223	SPC8899	Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Лён	упак	0	4650218305068.0	5528.88	SPC панели	Тканевая Роскошь	Лён	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Лён	{}	\N	Склад	1	55	2025-08-28 08:50:44.871817	2025-08-28 08:50:44.871822	5.04	7.0
acdd456a-49dd-48e0-9e1e-0a5f8a5eb54e	SPC8895	Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Сатин	упак	0	4650218304863.0	4739.04	SPC панели	Тканевая Роскошь	Сатин	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Сатин	{}	\N	Склад	1	56	2025-08-28 08:50:44.893767	2025-08-28 08:50:44.893771	4.32	24.0
37f94173-2772-4c14-b8be-35f6b5295477	SPC8902	Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Сатин	упак	0	4650218305044.0	5528.88	SPC панели	Тканевая Роскошь	Сатин	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Сатин	{}	\N	Склад	1	57	2025-08-28 08:50:44.915486	2025-08-28 08:50:44.915491	5.04	7.0
b79bfe9e-2200-4fd5-9579-ae0904c29b6a	SPC8896	Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Шифон	упак	0	4650218305006.0	4739.04	SPC панели	Тканевая Роскошь	Шифон	300х600х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 300х600х2,4мм 4,32м2/уп (24шт/уп) Шифон	{}	\N	Склад	1	58	2025-08-28 08:50:44.937286	2025-08-28 08:50:44.937291	4.32	24.0
beafbac6-62b4-43ba-94ab-785ea33df0eb	SPC8903	Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Шифон	упак	0	4650218305020.0	5528.88	SPC панели	Тканевая Роскошь	Шифон	600х1200х2,4мм	упак		[]	Панель Панель SPC стеновая Альта Слэб Тканевая Роскошь 600х1200х2,4мм 5,04м2/уп (7шт/уп) Шифон	{}	\N	Склад	1	59	2025-08-28 08:50:44.959008	2025-08-28 08:50:44.959012	5.04	7.0
3fab78c0-97c3-4579-b955-15744cb1b90c	SPC9075	Профиль алюминиевый под рассеивателем 081024-4 анод бронза 2,7м (30шт/уп)	шт	0	4680427157004.0	720	SPC панели	Профиль	Бронза		упак		[]	Панель Профиль алюминиевый под рассеивателем 081024-4 анод бронза 2,7м (30шт/уп)	{}	\N	Склад	1	62	2025-08-28 08:50:45.025181	2025-08-28 08:50:45.025186	\N	30.0
8034f265-bfcb-4308-9918-a7c9c35c3be8	SPC9059	Профиль алюминиевый под рассеивателем 081024-4 анод серебро 2,7м (30шт/уп)	шт	0	4680427157011.0	720	SPC панели	Профиль	Серебро		упак		[]	Панель Профиль алюминиевый под рассеивателем 081024-4 анод серебро 2,7м (30шт/уп)	{}	\N	Склад	1	63	2025-08-28 08:50:45.047152	2025-08-28 08:50:45.047156	\N	30.0
dc2a2d0a-41e7-4dbf-b520-ce7630ff1c9e	SPC9076	Профиль алюминиевый под рассеивателем 081024-4 анод шампань 2,7м (30шт/уп)	шт	0	4680427157028.0	720	SPC панели	Профиль	Шампань		упак		[]	Панель Профиль алюминиевый под рассеивателем 081024-4 анод шампань 2,7м (30шт/уп)	{}	\N	Склад	1	64	2025-08-28 08:50:45.069006	2025-08-28 08:50:45.06901	\N	30.0
a1d7f2aa-1455-4c2b-a36c-fd2fd6cbe2af	SPC9077	Профиль алюминиевый соединительный 081024-2 анод бронза 2,7м (30шт/уп)	шт	0	4680427157035.0	420	SPC панели	Профиль	Бронза		упак		[]	Панель Профиль алюминиевый соединительный 081024-2 анод бронза 2,7м (30шт/уп)	{}	\N	Склад	1	65	2025-08-28 08:50:45.090877	2025-08-28 08:50:45.090881	\N	30.0
2a5738b1-40c6-4741-93a6-fe288e5b85c4	SPC9057	Профиль алюминиевый соединительный 081024-2 анод серебро 2,7м (30шт/уп)	шт	0	4680427157042.0	420	SPC панели	Профиль	Серебро		упак		[]	Панель Профиль алюминиевый соединительный 081024-2 анод серебро 2,7м (30шт/уп)	{}	\N	Склад	1	66	2025-08-28 08:50:45.112545	2025-08-28 08:50:45.112551	\N	30.0
546110d7-02d9-4717-989f-cb0c4c3284e4	SPC9078	Профиль алюминиевый соединительный 081024-2 анод шампань 2,7м (30шт/уп)	шт	0	4680427157059.0	420	SPC панели	Профиль	Шампань		упак		[]	Панель Профиль алюминиевый соединительный 081024-2 анод шампань 2,7м (30шт/уп)	{}	\N	Склад	1	67	2025-08-28 08:50:45.135049	2025-08-28 08:50:45.135053	\N	30.0
b7747ad6-d1e7-4110-9055-b08d4e7e501e	SPC9073	Профиль алюминиевый торцевой 081024-1 анод бронза 2,7м (30шт/уп)	шт	0	4680427157066.0	440	SPC панели	Профиль	Бронза		упак		[]	Панель Профиль алюминиевый торцевой 081024-1 анод бронза 2,7м (30шт/уп)	{}	\N	Склад	1	68	2025-08-28 08:50:45.156965	2025-08-28 08:50:45.156968	\N	30.0
5916f809-d8a5-4ffa-aad0-bf6ad9a0b6c9	SPC9056	Профиль алюминиевый торцевой 081024-1 анод серебро 2,7м (30шт/уп)	шт	0	4680427157073.0	440	SPC панели	Профиль	Серебро		упак		[]	Панель Профиль алюминиевый торцевой 081024-1 анод серебро 2,7м (30шт/уп)	{}	\N	Склад	1	69	2025-08-28 08:50:45.178588	2025-08-28 08:50:45.178592	\N	30.0
137dcd16-f2dd-4732-b2be-92bd9950dc15	SPC9074	Профиль алюминиевый торцевой 081024-1 анод шампань 2,7м (30шт/уп)	шт	0	4680427157080.0	440	SPC панели	Профиль	Шампань		упак		[]	Панель Профиль алюминиевый торцевой 081024-1 анод шампань 2,7м (30шт/уп)	{}	\N	Склад	1	70	2025-08-28 08:50:45.200828	2025-08-28 08:50:45.200832	\N	30.0
82a546ad-d4a3-45de-87c0-d3a8f77c88a3	SPC9079	Профиль алюминиевый угловой универсальный 081024-3 анод бронза 2,7м (30шт/уп)	шт	0	4680427157097.0	670	SPC панели	Профиль	Бронза		упак		[]	Панель Профиль алюминиевый угловой универсальный 081024-3 анод бронза 2,7м (30шт/уп)	{}	\N	Склад	1	71	2025-08-28 08:50:45.222374	2025-08-28 08:50:45.222379	\N	30.0
b3bd040d-a1ef-4436-9c99-e0e65733ec86	SPC9058	Профиль алюминиевый угловой универсальный 081024-3 анод серебро 2,7м (30шт/уп)	шт	0	4680427157103.0	670	SPC панели	Профиль	Серебро		упак		[]	Панель Профиль алюминиевый угловой универсальный 081024-3 анод серебро 2,7м (30шт/уп)	{}	\N	Склад	1	72	2025-08-28 08:50:45.244355	2025-08-28 08:50:45.244359	\N	30.0
d606acbd-340b-4ce2-a8b9-a6ba215a8cf5	SPC9080	Профиль алюминиевый угловой универсальный 081024-3 анод шампань 2,7м (30шт/уп)	шт	0	4680427157110.0	670	SPC панели	Профиль	Шампань		упак		[]	Панель Профиль алюминиевый угловой универсальный 081024-3 анод шампань 2,7м (30шт/уп)	{}	\N	Склад	1	73	2025-08-28 08:50:45.265983	2025-08-28 08:50:45.265988	\N	30.0
cf2b0345-e46a-44d8-83be-288550eba4f5	AUTO_60	Клей и профиля для Панелей Альта Слэб	nan	0	\N	nan	SPC панели	Клей	Стандарт		упак		[]	Панель Клей и профиля для Панелей Альта Слэб	{}	\N	nan	1	60	2025-08-28 08:50:44.981061	2025-08-28 08:50:44.981066	\N	\N
5b6578f5-4152-4922-9b3b-1ccf3baa4edb	SPC8907	Клей для потолочно-стеновых SPC панелей Альта Стик 900 гр/600 мл (12шт/уп)	шт	0	4680136702946.0	1350	SPC панели	Клей	Стандарт		упак		[]	Панель Клей для потолочно-стеновых SPC панелей Альта Стик 900 гр/600 мл (12шт/уп)	{}	\N	Склад	1	61	2025-08-28 08:50:45.003303	2025-08-28 08:50:45.003308	\N	12.0
\.


--
-- Data for Name: certificates; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public.certificates (id, title, description, issue_date, valid_until, issuer, size, number, image_url, file_url, sort_order, created_at, updated_at) FROM stdin;
55da778e-6950-4640-96a3-3bae7d35e167	Экологический сертификат соответствия	Безопасность для здоровья человека, отсутствие вредных выделений	10.02.2024	10.02.2027	ЭкоСтандарт	1.5 МБ	ECO.RU.7844.Н04521	\N	\N	3	2025-08-19 16:12:00.747013	2025-08-19 16:12:00.747013
53c0be5b-87f9-4891-a5e3-91577a726918	ISO 9001:2015 Система менеджмента качества	Международная сертификация системы управления качеством производства	05.04.2024	05.04.2027	TÜV NORD CERT GmbH	2.3 МБ	ISO-9001-2024-45637	\N	\N	4	2025-08-19 16:12:00.747013	2025-08-19 16:12:00.747013
036ba790-0823-4498-9f2c-fdd58b9ccf33	Сертификат пожарной безопасности	Класс пожарной опасности КМ1 (слабогорючие, трудновоспламеняемые материалы)	22.01.2024	22.01.2029	ФГУ ВНИИПО МЧС России	1.8 МБ	СПБ.RU.ОП003.Н.03156			2	2025-08-19 16:12:00.747013	2025-09-09 15:12:49.208
ee984995-61d6-41e6-9ff7-a87ef3f536d0	Сертификат соответствия ГОСТ Р 56926-2016	Подтверждение соответствия продукции требованиям ГОСТ Р для композитных материалов	15.03.2024	15.03.2027	ФБУ "Ростест-Москва"	2.1 МБ	РОСС RU.АИ44.Н03421		/api/admin/documents/certificates/Варианты.pdf	1	2025-08-19 16:12:00.747013	2025-09-09 16:19:54.721
\.


--
-- Data for Name: dealer_locations; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public.dealer_locations (id, name, address, city, region, phone, email, website, latitude, longitude, dealer_type, services, working_hours, is_active, sort_order, created_at, updated_at) FROM stdin;
652f5c16-6ca2-46e7-a7b4-834510bd4d81	Альта-Дизайн	Коммунистическая улица, 25Гк11/20 Тракт Терминал ПЛ 15	Мытищи	Московская область	\N	\N	\N	55.909	37.735	retail	[]	\N	1	7	2025-09-12 17:37:47.128461	2025-09-12 18:58:43.781598
6f967bab-c439-490d-b8f4-af28b1f7b5d8	Альта-Дизайн	деревня Тетерино, Гросс павильон 305	Можайск	Московская область	\N	\N	\N	55.505	36.021	retail	[]	\N	1	5	2025-09-12 17:37:47.075852	2025-09-12 17:37:47.075852
66592688-d295-41df-8384-31c9778ee8d6	Альта Северо-Запад	пр-кт Тореза, д 95	Санкт-Петербург	Ленинградская область	+7 (812) 495-66-09 / +7 (981) 807-13-00 / +7 (800) 555-77-73 доб. 7801	\N	\N	60.029413	30.322300	retail	[]	\N	1	9	2025-09-12 17:37:47.177251	2025-09-12 18:53:11.115197
704bb3bc-d5dd-419e-bee5-236347d5872b	Альта-Дизайн	ул Горбуновская, д 31	Хотьково	Московская область	\N	\N	\N	55.999	37.766	retail	[]	\N	1	0	2025-09-12 17:37:46.941337	2025-09-12 18:58:25.852378
d9123f64-5030-4ddb-accc-daef55bab656	Альта-Дизайн	деревня Соболиха, ул Новослободская, д 19А Павильон м-3	Балашиха	Московская область	\N	\N	\N	55.763	38.002	retail	[]	\N	1	1	2025-09-12 17:37:46.981624	2025-09-12 18:58:26.219073
b8e96d9b-edcd-4eb8-b441-59975f0b8525	Альта-Дизайн	деревня Есипово, д 117/1	Солнечногорск	Московская область	+7 (963) 609-05-11 / +7 (903) 212-86-84	\N	\N	56.184	36.961	retail	[]	\N	1	4	2025-09-12 17:37:47.051949	2025-09-12 18:58:27.106157
71d479c6-62ea-4df2-aaa4-b74628911c13	Альта-Дизайн	ул Социалистическая, д 76	Руза	Московская область	\N	\N	\N	55.707	36.196	retail	[]	\N	1	6	2025-09-12 17:37:47.10039	2025-09-12 18:58:29.824891
2b5e6c03-d090-4d89-a994-995a3135d1e7	Альта-Дилер, ИП РОГОЗОВ	ул. Московская, 16	Зарайск	Московская область	\N	\N	\N	54.760	38.876	retail	[]	\N	1	8	2025-09-12 17:37:47.153173	2025-09-12 18:58:41.293265
875e96eb-67f4-4ce2-b74e-24d396701182	Альта-Дизайн	ул Дурыманова, д 11	Клин	Московская область	\N	\N	\N	56.3255	36.7186	retail	[]	\N	1	2	2025-09-12 17:37:47.005016	2025-09-12 18:58:41.99671
795af377-0cbe-4de8-9f04-26d2ea0cdf57	Альта-Дизайн	ул. Транспортная, влд 8	Клин	Московская область	+7 (968) 951-54-22 / +7 (903) 212-86-84	\N	\N	56.3387	36.7394	retail	[]	\N	1	3	2025-09-12 17:37:47.028215	2025-09-12 18:58:43.066364
\.


--
-- Data for Name: gallery_projects; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public.gallery_projects (id, title, description, application, images, materials_used, location, area, year, is_active, sort_order, created_at, updated_at) FROM stdin;
a3e0bc6a-e5a0-4687-a7f7-030b47b3fa4f	1111	1111	interior	["/assets/gallery/gallery-25.jpg"]	["8930"]		111	1111	1	0	2025-09-12 21:00:04.555363	2025-09-13 07:58:52.404
9d4e9951-128b-4e02-9d4a-0ed199c9bfa8	222	222 jgbcfytb 	interior	["/assets/gallery/gallery-27.jpg"]	["8883"]				1	0	2025-09-13 19:16:14.943584	2025-09-13 19:16:14.943584
\.


--
-- Data for Name: hero_images; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public.hero_images (id, title, image_url, is_active, sort_order, created_at, updated_at) FROM stdin;
45be52cc-7de3-4566-ae54-969327326b64	Hero-1	/objects/uploads/e39d7d54-d448-4246-b92f-283fb90bac53	1	0	2025-08-19 18:50:03.738041	2025-08-19 18:50:03.738041
ba050c9c-ab7a-4b33-adf6-4c4e76a1eecd	Hero-2	/objects/uploads/71be181e-9162-4bcb-9d46-6de990f4f120	1	1	2025-08-19 18:50:06.39912	2025-08-19 18:50:06.39912
a519cabb-dec7-4ded-8a3f-2654f6713b98	Hero-3	/objects/uploads/07b065fa-79e9-4305-bbec-c42434a7deac	1	2	2025-08-19 18:50:09.625873	2025-08-19 18:50:09.625873
a3fe5ec5-73ef-4ca3-b73b-290d73d68852	Hero-4	/objects/uploads/fc373f8f-0815-47cf-94c4-ab0443f11260	1	3	2025-08-19 18:50:12.597487	2025-08-19 18:50:12.597487
39a06171-219b-4df4-80e9-178820c863a9	Hero-5	/objects/uploads/e00a0640-381c-4a5d-a73d-e48a9e20187a	1	4	2025-08-19 18:50:15.599732	2025-08-19 18:50:15.599732
\.


--
-- Data for Name: installation_instructions; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public.installation_instructions (id, title, description, category, size, file_url, sort_order, created_at, updated_at) FROM stdin;
a5820e20-597d-4255-a5dd-e5694ace287b	Подробная инструкция по монтажу	\N	installation-guide	PDF, 2.4 МБ	/docs/installation-guide.pdf	1	2025-09-08 11:27:04.929264	2025-09-08 11:27:04.929264
\.


--
-- Data for Name: users; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public.users (id, username, password) FROM stdin;
\.


--
-- Data for Name: video_instructions; Type: TABLE DATA; Schema: public; Owner: neondb_owner
--

COPY public.video_instructions (id, title, description, duration, category, video_url, thumbnail_url, sort_order, created_at, updated_at) FROM stdin;
c88faf49-11fe-4131-bf2d-06a5c2abe704	Инструкция по монтажу	Инструкция по монтажу стеновых панелей SPC АЛЬТА СЛЭБ	3:12	монтаж	https://rutube.ru/video/be5b1d4facbb9625c89af06353fc9dbc/	https://i.ytimg.com/vi/3OzT5w0AFS4/maxresdefault.jpg	0	2025-09-08 07:31:55.63849	2025-09-13 08:27:05.852
6b1b9ee3-a8a4-40f7-b78f-e2cb9933ac0b	Второе видео	Второе видео описание	2:14	монтаж	https://rutube.ru/video/b2d5ad198fd13230629c608616d45f9c/		0	2025-09-13 09:53:47.054727	2025-09-13 09:53:47.054727
\.


--
-- Name: catalog_products catalog_products_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public.catalog_products
    ADD CONSTRAINT catalog_products_pkey PRIMARY KEY (id);


--
-- Name: catalog_products catalog_products_product_code_unique; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public.catalog_products
    ADD CONSTRAINT catalog_products_product_code_unique UNIQUE (product_code);


--
-- Name: certificates certificates_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public.certificates
    ADD CONSTRAINT certificates_pkey PRIMARY KEY (id);


--
-- Name: dealer_locations dealer_locations_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public.dealer_locations
    ADD CONSTRAINT dealer_locations_pkey PRIMARY KEY (id);


--
-- Name: gallery_projects gallery_projects_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public.gallery_projects
    ADD CONSTRAINT gallery_projects_pkey PRIMARY KEY (id);


--
-- Name: hero_images hero_images_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public.hero_images
    ADD CONSTRAINT hero_images_pkey PRIMARY KEY (id);


--
-- Name: installation_instructions installation_instructions_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public.installation_instructions
    ADD CONSTRAINT installation_instructions_pkey PRIMARY KEY (id);


--
-- Name: users users_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public.users
    ADD CONSTRAINT users_pkey PRIMARY KEY (id);


--
-- Name: users users_username_unique; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public.users
    ADD CONSTRAINT users_username_unique UNIQUE (username);


--
-- Name: video_instructions video_instructions_pkey; Type: CONSTRAINT; Schema: public; Owner: neondb_owner
--

ALTER TABLE ONLY public.video_instructions
    ADD CONSTRAINT video_instructions_pkey PRIMARY KEY (id);


--
-- Name: DEFAULT PRIVILEGES FOR SEQUENCES; Type: DEFAULT ACL; Schema: public; Owner: cloud_admin
--

ALTER DEFAULT PRIVILEGES FOR ROLE cloud_admin IN SCHEMA public GRANT ALL ON SEQUENCES TO neon_superuser WITH GRANT OPTION;


--
-- Name: DEFAULT PRIVILEGES FOR TABLES; Type: DEFAULT ACL; Schema: public; Owner: cloud_admin
--

ALTER DEFAULT PRIVILEGES FOR ROLE cloud_admin IN SCHEMA public GRANT ALL ON TABLES TO neon_superuser WITH GRANT OPTION;


--
-- PostgreSQL database dump complete
--

