export default function AboutMaterial() {
  return (
    <section id="material" className="py-12 lg:py-20 bg-white">
      <div className="container mx-auto px-4 lg:px-6">
        <div className="max-w-4xl mx-auto text-center">
          <h2 className="text-2xl lg:text-3xl xl:text-4xl font-bold text-[#2f378b] mb-6 lg:mb-8">
            О МАТЕРИАЛЕ
          </h2>
          <div className="max-w-3xl mx-auto text-secondary leading-relaxed">
            <p className="text-sm lg:text-lg mb-4 lg:mb-6">
              Стеновые панели SPC (Stone Plastic Composite) представляют собой
              современный и инновационный материал, который успешно объединяет в
              себе свойства камня и полимеров. Такие панели становятся всё более
              популярны благодаря своей многофункциональности и универсальности,
              подходят как для жилых, так и для коммерческих помещений.
            </p>
            <p className="text-sm lg:text-lg mb-4 lg:mb-6">
              СТРУКТУРА СТЕНОВЫХ ПАНЕЛЕЙ АЛЬТА СЛЭБ: ДВА СЛОЯ – СПЕЦИАЛЬНАЯ UV
              ЗАЩИТА Сохраняет декоративные свойства и защищает от
              ультрафиолетового излучения. ДЕКОРАТИВНАЯ ПЛЁНКА Разнообразие
              дизайнов, которые могут имитировать различные материалы, такие как
              дерево, камень, текстиль и другие, а также включать художественные
              узоры и абстракции. КАЛЬЦИЕВО-ПОЛИМЕРНАЯ ОСНОВА высокой прочности,
              устойчива к влаге, обладающая хорошими прочностными свойствами,
              что делает их подходящими для применения в условиях с интенсивными
              нагрузками в любых помещениях.
            </p>
            <p className="text-sm lg:text-lg">
              СИСТЕМА ЗАМКОВОГО СОЕДИНЕНИЯ «SEAMLESSLOCK» • БЕСШОВНОЕ СОЕДИНЕНИЕ
              – БЫСТРАЯ И ПРОСТАЯ УСТАНОВКА. • НЕ ТРЕБУЕТСЯ ЗАТИРКИ И
              ГЕРМЕТИЗАЦИИ СОЕДИНЕНИЙ.
            </p>
          </div>
        </div>
      </div>
    </section>
  );
}
